Revit 2027 API
Edge.GetCurveUV(Int32, Transform2D) Method
Calculate and transform a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveUV GetCurveUV(
	int index,
	Transform2D transform
)
Public Function GetCurveUV (
	index As Integer,
	transform As Transform2D
) As CurveUV
public:
CurveUV^ GetCurveUV(
	int index,
	Transform2D^ transform
)
member GetCurveUV :
        index : int *
        transform : Transform2D -> CurveUV
Parameters
index Int32
The index of the face (0 or 1).
transform Transform2D
Transformation to apply to the curve.
Return Value
CurveUV
If successful, returns the calculated and transformed CurveUV, null otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the specified index is not 0 or 1.
Remarks
Use of this function is preferred over using GetCurveUV(int index) and then transforming the curve, as the latter approach may yield a less accurate result.
See Also
Reference
Edge Class
GetCurveUV Overload
Autodesk.Revit.DB Namespace